Тест_ЗУП_31_КОРП/src/ExchangePlans/ОбменВРаспределеннойИнформационнойБазе/ОбменВРаспределеннойИнформационнойБазе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="1f3816a9-28aa-447f-be60-1e4215bd6623">
  <name>ОбменВРаспределеннойИнформационнойБазе</name>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

Тест_ЗУП_31_КОРП/src/ExchangePlans/ОбменВРаспределеннойИнформационнойБазе/Forms/ФормаНастройкиУзла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбменДаннымиСервер.ФормаНастройкиУзлаПриСозданииНаСервере(ЭтаФорма, "ОбменВРаспределеннойИнформационнойБазе");
	
	РежимСинхронизацииОрганизаций =
		?(ИспользоватьОтборПоОрганизациям, "СинхронизироватьДанныеТолькоПоВыбраннымОрганизациям", "СинхронизироватьДанныеПоВсемОрганизациям");
	
	ИспользуемыеОрганизации = Организации.Выгрузить();
	Организации.Загрузить(ВсеОрганизацииПриложения());
	
	ОтметитьВыбранныеЭлементыТаблицы(ИспользуемыеОрганизации, "Организации", "Организация");
	
	РежимСинхронизацииПодразделений =
		?(ИспользоватьОтборПоПодразделениям, "СинхронизироватьДанныеТолькоПоВыбраннымПодразделениям", "СинхронизироватьДанныеПоВсемПодразделениям");
	
	ВсеПодразделенияПриложения = ВсеПодразделенияПриложения();
	Если ВсеПодразделенияПриложения <> Неопределено Тогда
		ПодразделенияДерево = РеквизитФормыВЗначение("ПодразделенияДеревоЗначений");
		Для каждого СтрокаТаблицы Из ВсеПодразделенияПриложения Цикл
			СтрокаРодителя = ПодразделенияДерево.Строки.Найти(СтрокаТаблицы.ПодразделениеРодитель, "Подразделение", Истина);
			Если СтрокаРодителя = Неопределено Тогда
				СтрокаДерева = ПодразделенияДерево.Строки.Добавить();
			Иначе
				СтрокаДерева = СтрокаРодителя.Строки.Добавить();
			КонецЕсли;
			
			СтрокаДерева.Подразделение = СтрокаТаблицы.Подразделение;
		КонецЦикла;
		ПодразделенияДерево.Строки.Сортировать("Подразделение", Истина);
		// Отметим выбранные элементы
		Для Каждого СтрокаТаблицы Из Подразделения Цикл
			НайденнаяСтрока = ПодразделенияДерево.Строки.Найти(СтрокаТаблицы.Подразделение, "Подразделение", Истина);
			Если НайденнаяСтрока <> Неопределено Тогда
				НайденнаяСтрока.Использовать = Истина;
			КонецЕсли;
		КонецЦикла;
		ЗначениеВРеквизитФормы(ПодразделенияДерево, "ПодразделенияДеревоЗначений");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РежимСинхронизацииОрганизацийПриИзмененииЗначения();
	РежимСинхронизацииПодразделенийПриИзмененииЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПодразделенияИспользоватьПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Подразделения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПодразделенияИспользоватьПриИзмененииНаСервере(ТекущиеДанные.Подразделение, ТекущиеДанные.Использовать);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизацииОрганизацийПриИзменении(Элемент)
	
	РежимСинхронизацииОрганизацийПриИзмененииЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизацииПодразделенийПриИзменении(Элемент)
	РежимСинхронизацииПодразделенийПриИзмененииЗначения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьВсеОрганизации(Команда)
	
	ВключитьОтключитьВсеЭлементыВТаблице(Истина, "Организации");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеОрганизации(Команда)
	
	ВключитьОтключитьВсеЭлементыВТаблице(Ложь, "Организации");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ИспользоватьОтборПоОрганизациям =
		(РежимСинхронизацииОрганизаций = "СинхронизироватьДанныеТолькоПоВыбраннымОрганизациям");
	
	ИспользоватьОтборПоПодразделениям =
		(РежимСинхронизацииПодразделений = "СинхронизироватьДанныеТолькоПоВыбраннымПодразделениям");
	
	ЗаписатьИЗакрытьСервер();
	
	ОбменДаннымиКлиент.ФормаНастройкиУзлаКомандаЗакрытьФорму(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсеПодразделения(Команда)
	ВключитьОтключитьВсеЭлементыВДеревеЗначений(Истина, ПодразделенияДеревоЗначений.ПолучитьЭлементы());
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьВсеПодразделения(Команда)
	ВключитьОтключитьВсеЭлементыВДеревеЗначений(Ложь, ПодразделенияДеревоЗначений.ПолучитьЭлементы());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВключитьОтключитьВсеЭлементыВТаблице(Включить, ИмяТаблицы)
	
	Для Каждого ЭлементКоллекции Из ЭтаФорма[ИмяТаблицы] Цикл
		
		ЭлементКоллекции.Использовать = Включить;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОтключитьВсеЭлементыВДеревеЗначений(Включить, Строки)
	
	Для Каждого ЭлементКоллекции Из Строки Цикл
		ЭлементКоллекции.Использовать = Включить;
		ВключитьОтключитьВсеЭлементыВДеревеЗначений(Включить, ЭлементКоллекции.ПолучитьЭлементы());
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВсеОрганизацииПриложения()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ЛОЖЬ КАК Использовать,
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	НЕ Организации.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организации.Наименование";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервереБезКонтекста
Функция ВсеПодразделенияПриложения()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		Возврат Модуль.СтруктураПредприятия();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ОтметитьВыбранныеЭлементыТаблицы(ТаблицаИспользуемые, ИмяТаблицы, ИмяРеквизита)
	
	Для Каждого СтрокаТаблицы Из ТаблицаИспользуемые Цикл
		
		Строки = ЭтотОбъект[ИмяТаблицы].НайтиСтроки(Новый Структура(ИмяРеквизита, СтрокаТаблицы[ИмяРеквизита]));
		
		Если Строки.Количество() > 0 Тогда
			
			Строки[0].Использовать = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизацииОрганизацийПриИзмененииЗначения()
	
	Элементы.Организации.Доступность =
		(РежимСинхронизацииОрганизаций = "СинхронизироватьДанныеТолькоПоВыбраннымОрганизациям")
	;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимСинхронизацииПодразделенийПриИзмененииЗначения()
	
	Элементы.Подразделения.Доступность =
		(РежимСинхронизацииПодразделений = "СинхронизироватьДанныеТолькоПоВыбраннымПодразделениям");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьСервер()
	
	Если ИспользоватьОтборПоОрганизациям Тогда
		
		ВыбранныеОрганизации = Организации.Выгрузить(Новый Структура("Использовать", Истина), "Организация");
		Организации.Загрузить(ВыбранныеОрганизации);
		
	Иначе
		Организации.Очистить();
	КонецЕсли;
	
	Подразделения.Очистить();
	Если ИспользоватьОтборПоПодразделениям Тогда
		ПодразделенияДерево = РеквизитФормыВЗначение("ПодразделенияДеревоЗначений");
		НайденныеСтроки = ПодразделенияДерево.Строки.НайтиСтроки(Новый Структура("Использовать", Истина), Истина);
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НоваяСтрока = Подразделения.Добавить();
			НоваяСтрока.Подразделение = НайденнаяСтрока.Подразделение;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодразделенияИспользоватьПриИзмененииНаСервере(Подразделение, Использование)
	
	МассивПодразделений = Новый Массив;
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		МассивПодразделений = Модуль.ПодчиненныеПодразделения(Подразделение);
	КонецЕсли;
	
	УстановитьИспользованиеПодразделения(ПодразделенияДеревоЗначений.ПолучитьЭлементы(), МассивПодразделений, Использование);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИспользованиеПодразделения(ЭлементыДерева, МассивПодразделений, Использование)
	
	Для каждого СтрокаПодразделения Из ЭлементыДерева Цикл
		Если МассивПодразделений.Найти(СтрокаПодразделения.Подразделение) <> Неопределено Тогда
			СтрокаПодразделения.Использовать = Использование;
		КонецЕсли;
		УстановитьИспользованиеПодразделения(СтрокаПодразделения.ПолучитьЭлементы(), МассивПодразделений, Использование);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
